[
    {
      "name": "Веб-приложение",
      "value": "Клиент-серверное приложение, в котором клиент взаимодействует с веб-сервером при помощи браузера."
    },
    {
      "name": "Web Mining",
      "value": "Использование методов интеллектуального анализа данных для автоматического обнаружения веб-документов и сервисов, извлечения информации из веб-ресурсов и выявления общих закономерностей в Интернете."
    },
    {
      "name": "Web content mining",
      "value": "Процесс извлечения знаний из контента документов или их описания, доступных в Интернете."
    },
    {
      "name": "Web usage mining",
      "value": "Автоматическое обнаружение шаблонов в маршруте передвижения пользователя и связанных с ним данными, собранными или приобретенными в результате взаимодействия с одним или несколькими веб-сайтами."
    },
    {
      "name": "Web structure mining",
      "value": "Процесс обнаружения структурной информации в Интернете."
    },
    {
      "name": "Веб-скрэпинг",
      "value": "Процесс извлечения информации из веб-страниц, который фокусируется на преобразовании неструктурированных данных в сети (например, в формате HTML) в структурированный формат данных, который может быть проанализирован и сохранен."
    },
    {
      "name": "Парсинг",
      "value": "Синтаксический анализ или разбор содержимого страницы. Общая идея заключается в создании математической модели на каком-либо языке программирования для сравнения лексем с формальной грамматикой."
    },
    {
      "name": "Восходящий парсер",
      "value": "Парсер, в котором продукции восстанавливаются из правых частей, начиная с токенов-лексем и кончая стартовым символом."
    },
    {
      "name": "Нисходящий парсер",
      "value": "Парсер, в котором продукции грамматики раскрываются, начиная со стартового символа, до получения требуемой последовательности лексем."
    },
    {
      "name": "Лексический анализ",
      "value": "Процесс аналитического разбора входной последовательности символов на распознанные группы – лексемы – с целью получения на выходе идентифицирующих последовательностей, называемых «токенами»."
    },
    {
      "name": "Обфускация",
      "value": "Приведение исходного текста или исполняемого кода программы к виду, сохраняющему её функциональность, но затрудняющему анализ, понимание алгоритмов работы и модификацию при декомпиляции."
    },
    {
      "name": "Обфускатор",
      "value": "Специальная программа, производящая обфускацию."
    },
    {
      "name": "Минификация",
      "value": "Процесс, направленный на уменьшение размера исходного кода путём удаления ненужных символов без изменения его функциональности."
    },
    {
      "name": "Минификатор",
      "value": "Специальная программа, производящая минификацию."
    },
    {
      "name": "AST",
      "value": "Расширяемое формальное представление синтаксической структуры программного обеспечения, которое поддается формальным методам анализа."
    }
]